#### 下載pandas

In [1]:
import pandas as pd

#### 運用Series將list轉成新的格式（給出索引）

In [2]:
l = [1,2,3,'Hi',"Amy",1.87]
s = pd.Series(l)

#### 查看l

In [3]:
l

[1, 2, 3, 'Hi', 'Amy', 1.87]

#### 查看s

In [4]:
s

0       1
1       2
2       3
3      Hi
4     Amy
5    1.87
dtype: object

#### 分別取出s的值

In [5]:
print(s[0])
print(s[3])
print(s[4])
print(s[5])

1
Hi
Amy
1.87

In [6]:
name = ['Amy','Leo','Lulu','Lisa','Jany']
subject = ['Chinese','Math','Science','Music','PE','History']
df = pd.DataFrame(index=name,columns=subject)
df

     Chinese Math Science Music   PE History
Amy      NaN  NaN     NaN   NaN  NaN     NaN
Leo      NaN  NaN     NaN   NaN  NaN     NaN
Lulu     NaN  NaN     NaN   NaN  NaN     NaN
Lisa     NaN  NaN     NaN   NaN  NaN     NaN
Jany     NaN  NaN     NaN   NaN  NaN     NaN

In [7]:
scores = [[ 52,85,96,100,75,54],[40,98,93,54,33,20],[100,97,54,55,100,88],
          [72,67,64,53,87,83],[45,90,100,55,34,96]]
df = pd.DataFrame(scores, index = name, columns = subject)
df

      Chinese  Math  Science  Music   PE  History
Amy        52    85       96    100   75       54
Leo        40    98       93     54   33       20
Lulu      100    97       54     55  100       88
Lisa       72    67       64     53   87       83
Jany       45    90      100     55   34       96

#### 依名自字母排序

In [8]:
df.sort_index(axis=0,ascending=False)

      Chinese  Math  Science  Music   PE  History
Lulu      100    97       54     55  100       88
Lisa       72    67       64     53   87       83
Leo        40    98       93     54   33       20
Jany       45    90      100     55   34       96
Amy        52    85       96    100   75       54

#### 依所選的欄的值排序

In [9]:
df.sort_values(by='PE')

      Chinese  Math  Science  Music   PE  History
Leo        40    98       93     54   33       20
Jany       45    90      100     55   34       96
Amy        52    85       96    100   75       54
Lisa       72    67       64     53   87       83
Lulu      100    97       54     55  100       88

#### 檢視基礎統計資料

In [10]:
df.describe()

         Chinese       Math     Science       Music          PE    History
count    5.00000   5.000000    5.000000    5.000000    5.000000   5.000000
mean    61.80000  87.400000   81.400000   63.400000   65.800000  68.200000
std     24.58048  12.581733   20.899761   20.476816   30.784736  31.260198
min     40.00000  67.000000   54.000000   53.000000   33.000000  20.000000
25%     45.00000  85.000000   64.000000   54.000000   34.000000  54.000000
50%     52.00000  90.000000   93.000000   55.000000   75.000000  83.000000
75%     72.00000  97.000000   96.000000   55.000000   87.000000  88.000000
max    100.00000  98.000000  100.000000  100.000000  100.000000  96.000000